## Plan Result (1037: staging - TerraformPlanApply)




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.keyvault_aks_access_policy
  * azurerm_key_vault_access_policy.keyvault_synapse_access_policy
  * azurerm_role_assignment.bais_bau_synapse_contributor[&#34;stg&#34;]
* Update
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.keyvault_aks_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "keyvault_aks_access_policy" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.KeyVault/vaults/baubais-stg-kv"
      + object_id               = "af50bed7-9f42-4dbb-8a02-68895999c155"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.keyvault_synapse_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "keyvault_synapse_access_policy" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.KeyVault/vaults/baubais-stg-kv"
      + object_id               = "6c9985b3-1f04-4701-b9d3-dc01b1dc610e"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_role_assignment.bais_bau_synapse_contributor["stg"] will be created
  + resource "azurerm_role_assignment" "bais_bau_synapse_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c9985b3-1f04-4701-b9d3-dc01b1dc610e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Synapse/workspaces/baubais-synapse-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
        name                               = "synapsebaubaisstg"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"","Target":"1037: staging - TerraformPlanApply","Vars":{}} -->